app/controllers/api/v1/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", -10]]
---
  def index
    @pokemons = Pokemon.paginate(page: params[:page], per_page: 10)

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @pokemon = Pokemon.find_by(id: params[:id])

INSERT INTO "pokemons" ("name", "type_1", "type_2", "total", "hp", "attack", "defense", "sp_atk", "sp_def", "speed", "generation", "legendary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    pokemon = Pokemon.new(pokemon_params)
    if pokemon.save

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pokemons" SET "name" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["name", "CharizardUpadate"], ["updated_at", "2023-04-03 00:47:55.749491"], ["id", 1]]
---
  def update
    @pokemon = Pokemon.find_by(id: params[:id])

    if @pokemon.update(pokemon_params)

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 10]]
---
  def destroy
    @pokemon = Pokemon.find_by(id: params[:id])

    if @pokemon.destroy